{
  "difficulty": "medium",
  "duration": "20 min",
  "commands": [
    {
      "name": "Step 1: Check Current Deployment",
      "command": "kubectl get deployment k8s-demo-deployment -n k8s-multi-demo",
      "description": "View the current deployment before adding health probes",
      "explanation": "Before adding liveness and readiness probes, we check the baseline deployment. Health probes are critical for production - they tell Kubernetes when pods are ready to serve traffic and when they need to be restarted.",
      "what_it_does": "Displays deployment status including replica count, age, and current state.",
      "next_step": "Note the current pod count. We'll add probes to make the deployment more resilient."
    },
    {
      "name": "Step 2: View Current Pod Status",
      "command": "kubectl get pods -n k8s-multi-demo",
      "description": "List all pods to see their current health status",
      "explanation": "Without health probes, Kubernetes only knows if the container process is running. It can't detect if the application inside is actually healthy or able to serve traffic. This can lead to routing traffic to broken pods.",
      "what_it_does": "Shows pod names, ready status, restart count, and age. READY column shows container readiness.",
      "next_step": "All pods should show 1/1 READY. But are they actually healthy? We can't tell without probes."
    },
    {
      "name": "Step 3: Deploy with Basic Probes",
      "command": "kubectl apply -f deployment.yaml -n k8s-multi-demo",
      "description": "Apply deployment with liveness and readiness probes configured",
      "explanation": "This deployment includes HTTP-based health probes. Liveness probe checks if the pod needs restarting (responds to /health). Readiness probe checks if the pod can receive traffic (/ready). These are different endpoints because a pod might be alive but not ready to serve requests.",
      "what_it_does": "Updates the deployment with health probe configuration. Kubernetes will start checking /health and /ready endpoints every few seconds.",
      "next_step": "Deployment updated. Kubernetes will now actively monitor pod health using the configured probes."
    },
    {
      "name": "Step 4: Monitor Pod Readiness",
      "command": "kubectl get pods -n k8s-multi-demo -w",
      "description": "Watch pods transition through readiness states (Press Ctrl+C to stop)",
      "explanation": "After adding probes, new pods must pass readiness checks before receiving traffic. Watch shows the transition: ContainerCreating → Running (0/1) → Running (1/1). The READY column changes when readiness probe succeeds.",
      "what_it_does": "Streams real-time pod status updates. You'll see READY go from 0/1 to 1/1 only after readiness probe passes.",
      "next_step": "Wait until all pods show 1/1 READY, then press Ctrl+C. This means probes are passing."
    },
    {
      "name": "Step 5: Check Probe Configuration",
      "command": "kubectl describe pod -n k8s-multi-demo -l app=k8s-demo | grep -A 5 'Liveness\\|Readiness'",
      "description": "View the actual probe configuration on running pods",
      "explanation": "The describe command shows exactly how probes are configured: what endpoint they hit, how often (periodSeconds), when they start checking (initialDelaySeconds), and failure thresholds. Understanding these settings is crucial for tuning production deployments.",
      "what_it_does": "Displays probe configuration including HTTP path, port, delay, timeout, period, success/failure thresholds.",
      "next_step": "Review the probe settings. Typical values: initialDelay 10s, period 10s, timeout 1s, failureThreshold 3."
    },
    {
      "name": "Step 6: Simulate Unhealthy Pod",
      "command": "kubectl exec -n k8s-multi-demo $(kubectl get pods -n k8s-multi-demo -o name | head -1) -- curl -X POST http://localhost:8000/health/fail",
      "description": "Make a pod's health endpoint fail to trigger liveness probe restart",
      "explanation": "This simulates application failure by making the /health endpoint return 500 errors. The liveness probe will fail 3 times (failureThreshold), then Kubernetes will restart the container. This demonstrates self-healing in action.",
      "what_it_does": "Sends POST to /health/fail endpoint, causing the pod to report unhealthy. Liveness probe will detect this and restart the container.",
      "next_step": "Wait 30-60 seconds. The pod will fail liveness checks and restart automatically."
    },
    {
      "name": "Step 7: Watch Pod Restart",
      "command": "kubectl get pods -n k8s-multi-demo",
      "description": "Check that the unhealthy pod was automatically restarted",
      "explanation": "After liveness probe failures, Kubernetes restarts the container (not the whole pod). Look at the RESTARTS column - it should have increased for the pod we made unhealthy. This is automatic recovery without manual intervention.",
      "what_it_does": "Shows current pod status. One pod will have RESTARTS > 0, proving liveness probe triggered a restart.",
      "next_step": "Find the pod with increased RESTARTS count. This pod was automatically healed by the liveness probe."
    },
    {
      "name": "Step 8: Check Pod Events for Probe Failures",
      "command": "kubectl describe pod -n k8s-multi-demo $(kubectl get pods -n k8s-multi-demo -o name | head -1) | grep -A 10 Events",
      "description": "View events showing probe failures and container restart",
      "explanation": "Kubernetes generates events for probe failures and restarts. Events show 'Liveness probe failed: HTTP probe failed' messages before 'Container was killed and restarted'. This event log is essential for diagnosing why pods restart in production.",
      "what_it_does": "Displays recent events for the pod including probe failure messages and restart reasons.",
      "next_step": "Look for 'Liveness probe failed' and 'Killing container' events. These prove the probe system worked."
    },
    {
      "name": "Step 9: Test Readiness Probe",
      "command": "kubectl exec -n k8s-multi-demo $(kubectl get pods -n k8s-multi-demo -o name | head -1) -- curl -X POST http://localhost:8000/ready/fail",
      "description": "Make a pod unready to see it removed from service endpoints",
      "explanation": "Unlike liveness (which restarts), readiness just removes the pod from service endpoints. The pod keeps running but stops receiving traffic. This is useful for graceful shutdowns or when the app is temporarily overloaded.",
      "what_it_does": "Makes /ready endpoint fail. Readiness probe will fail and Kubernetes will remove this pod from the service's endpoint list.",
      "next_step": "The pod will show 0/1 READY but won't restart. It's alive but not serving traffic."
    },
    {
      "name": "Step 10: Verify Pod Removed from Service",
      "command": "kubectl get endpoints k8s-demo-service -n k8s-multi-demo",
      "description": "Check that the unready pod is removed from service endpoints",
      "explanation": "Services route traffic only to pods with passing readiness probes. When we failed the readiness probe, Kubernetes removed that pod's IP from the endpoint list. Traffic now goes only to healthy pods. This prevents users from hitting broken backends.",
      "what_it_does": "Shows IP addresses of pods currently receiving traffic from the service. The unready pod's IP should be missing.",
      "next_step": "Compare IPs with 'kubectl get pods -o wide'. The pod with 0/1 READY won't be in the endpoint list."
    },
    {
      "name": "Cleanup: Remove Deployment",
      "command": "kubectl delete deployment k8s-demo-deployment -n k8s-multi-demo",
      "description": "Delete the deployment with probes (optional cleanup)",
      "explanation": "Removes the test deployment. In practice, you'd keep the deployment but this shows how to clean up test resources.",
      "what_it_does": "Deletes the deployment and all its pods.",
      "next_step": "Deployment deleted. Run the original deployment YAML to restore it without probes if needed.",
      "cleanup": true
    }
  ]
}